In [2]:
import numpy as np
import pandas as pd

In [3]:
df = pd.DataFrame({"key1" : ["a", "a", None, "b", "b", "a", None],
                    "key2" : pd.Series([1, 2, 1, 2, 1, None, 1], dtype="Int64"),
                    "data1" : np.random.standard_normal(7),
                    "data2" : np.random.standard_normal(7)})

df

   key1  key2     data1     data2
0     a     1 -0.354223 -0.189255
1     a     2 -1.258496 -0.551563
2  None     1  1.357856 -0.015926
3     b     2  0.737641 -0.325922
4     b     1  0.662773  0.875018
5     a  <NA> -1.122249  0.094818
6  None     1  1.079100  0.445998

In [4]:
grouped = df['data1'].groupby(df['key1'])
grouped

In [5]:
grouped.mean()

key1
a   -0.911656
b    0.700207
Name: data1, dtype: float64

In [6]:
means = df['data1'].groupby([df['key1'], df['key2']]).mean()
means

key1  key2
a     1      -0.354223
      2      -1.258496
b     1       0.662773
      2       0.737641
Name: data1, dtype: float64

In [7]:
df.groupby(['key1', 'key2'])['data1'].mean()

key1  key2
a     1      -0.354223
      2      -1.258496
b     1       0.662773
      2       0.737641
Name: data1, dtype: float64

In [8]:
means.unstack()

key2         1         2
key1
a    -0.354223 -1.258496
b     0.662773  0.737641

In [9]:
states = np.array(["OH", "CA", "CA", "OH", "OH", "CA", "OH"])
years = [2005, 2005, 2006, 2005, 2006, 2005, 2006]

In [10]:
df['data1'].groupby([states, years]).mean()

CA  2005   -1.190373
    2006    1.357856
OH  2005    0.191709
    2006    0.870937
Name: data1, dtype: float64

In [11]:
df.groupby('key1').mean()

      key2     data1     data2
key1
a      1.5 -0.911656 -0.215333
b      1.5  0.700207  0.274548

In [12]:
df.groupby(['key1', 'key2']).size()

key1  key2
a     1       1
      2       1
b     1       1
      2       1
dtype: int64

In [13]:
df.groupby('key1', dropna=False).size()

key1
a      3
b      2
NaN    2
dtype: int64

In [14]:
for name, group in df.groupby('key1'):
    print(name)
    print(group)

a
  key1  key2     data1     data2
0    a     1 -0.354223 -0.189255
1    a     2 -1.258496 -0.551563
5    a  <NA> -1.122249  0.094818
b
  key1  key2     data1     data2
3    b     2  0.737641 -0.325922
4    b     1  0.662773  0.875018

In [15]:
pieces = {name: group for name, group in df.groupby('key1')}
pieces['b']

  key1  key2     data1     data2
3    b     2  0.737641 -0.325922
4    b     1  0.662773  0.875018

In [16]:
people = pd.DataFrame(np.random.standard_normal((5, 5)),
                        columns=["a", "b", "c", "d", "e"],
                        index=["Joe", "Steve", "Wanda", "Jill", "Trey"])

people

              a         b         c         d         e
Joe    1.635487  0.118360 -0.109992 -0.035482 -0.278021
Steve  0.171291 -0.064377  1.187394  0.457026  0.549937
Wanda -0.912380  1.207691  1.265186 -0.369088  1.729800
Jill   0.577003 -0.259162 -0.795869  0.205255 -0.315262
Trey  -0.647916  1.331920  0.516910 -0.020567 -1.155069

In [17]:
people.groupby(len).sum()

          a         b         c         d         e
3  1.635487  0.118360 -0.109992 -0.035482 -0.278021
4 -0.070912  1.072758 -0.278959  0.184688 -1.470332
5 -0.741089  1.143314  2.452580  0.087938  2.279737

In [18]:
key_list = ["one", "one", "one", "two", "two"]
people.groupby([len, key_list]).min()

              a         b         c         d         e
3 one  1.635487  0.118360 -0.109992 -0.035482 -0.278021
4 two -0.647916 -0.259162 -0.795869 -0.020567 -1.155069
5 one -0.912380 -0.064377  1.187394 -0.369088  0.549937

In [19]:
columns = pd.MultiIndex.from_arrays([["US", "US", "US", "JP", "JP"],
                                    [1, 3, 5, 1, 3]],
                                    names=["cty", "tenor"])
columns

MultiIndex([('US', 1),
            ('US', 3),
            ('US', 5),
            ('JP', 1),
            ('JP', 3)],
           names=['cty', 'tenor'])

In [20]:
hier_df = pd.DataFrame(np.random.standard_normal((4,5)), columns=columns)
hier_df

cty          US                            JP
tenor         1         3         5         1         3
0      0.202526 -0.288383 -0.810789  1.275755 -0.470574
1     -1.846594 -0.325541 -1.320710  0.010025 -2.267983
2      1.556230  0.708521 -0.944244 -0.563757 -1.239977
3     -1.267873 -0.097309  0.449764  0.361494  0.608382

In [21]:
hier_df.groupby(level='cty', axis='columns').count()

/tmp/ipykernel_5233/1003050479.py:1: FutureWarning: DataFrame.groupby with axis=1 is deprecated. Do `frame.T.groupby(...)` without axis instead.
  hier_df.groupby(level='cty', axis='columns').count()

cty  JP  US
0     2   3
1     2   3
2     2   3
3     2   3

In [22]:
def peak_to_peak(arr):
    return arr.max() - arr.min()

In [23]:
df

   key1  key2     data1     data2
0     a     1 -0.354223 -0.189255
1     a     2 -1.258496 -0.551563
2  None     1  1.357856 -0.015926
3     b     2  0.737641 -0.325922
4     b     1  0.662773  0.875018
5     a  <NA> -1.122249  0.094818
6  None     1  1.079100  0.445998

In [24]:
grouped = df.groupby('key1')
grouped.agg(peak_to_peak)

      key2     data1     data2
key1
a        1  0.904274  0.646381
b        1  0.074868  1.200940

In [25]:
grouped.describe()

      key2                                           data1            ...  \
     count mean       std  min   25%  50%   75%  max count      mean  ...
key1                                                                  ...
a      2.0  1.5  0.707107  1.0  1.25  1.5  1.75  2.0   3.0 -0.911656  ...
b      2.0  1.5  0.707107  1.0  1.25  1.5  1.75  2.0   2.0  0.700207  ...

                         data2                                          \
           75%       max count      mean       std       min       25%
key1
a    -0.738236 -0.354223   3.0 -0.215333  0.323979 -0.551563 -0.370409
b     0.718924  0.737641   2.0  0.274548  0.849193 -0.325922 -0.025687


           50%       75%       max
key1
a    -0.189255 -0.047218  0.094818
b     0.274548  0.574783  0.875018

[2 rows x 24 columns]

In [28]:
frame = pd.DataFrame({"data1": np.random.standard_normal(1000),
                        "data2": np.random.standard_normal(1000)})

frame.head()

      data1     data2
0 -0.174340 -0.169569
1  0.644175 -0.664537
2  1.803590 -1.980106
3 -1.197466 -1.323753
4  1.413464 -0.848826

In [31]:
quartiles = pd.cut(frame['data1'], 4)
quartiles.head(10)

0    (-1.727, 0.0433]
1     (0.0433, 1.814]
2     (0.0433, 1.814]
3    (-1.727, 0.0433]
4     (0.0433, 1.814]
5      (1.814, 3.584]
6    (-1.727, 0.0433]
7     (0.0433, 1.814]
8    (-1.727, 0.0433]
9     (0.0433, 1.814]
Name: data1, dtype: category
Categories (4, interval[float64, right]): [(-3.505, -1.727] < (-1.727, 0.0433] < (0.0433, 1.814] < (1.814, 3.584]]

In [35]:
def get_stats(group):
    return pd.DataFrame(
        {'min': group.min(), 'max':group.max(),
         'count': group.count(), 'mean': group.mean()}
    )
    
grouped = frame.groupby(quartiles)
grouped

/tmp/ipykernel_5233/26368979.py:7: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  grouped = frame.groupby(quartiles)

In [37]:
grouped.apply(get_stats)

                             min       max  count      mean
data1
(-3.505, -1.727] data1 -3.497578 -1.759333     51 -2.108446
                 data2 -2.076120  2.279837     51 -0.006572
(-1.727, 0.0433] data1 -1.707023  0.042198    489 -0.661829
                 data2 -3.352173  2.772332    489 -0.051506
(0.0433, 1.814]  data1  0.043391  1.803590    422  0.671467
                 data2 -3.409401  3.055541    422 -0.047973
(1.814, 3.584]   data1  1.817167  3.584268     38  2.218650
                 data2 -1.572989  1.440923     38  0.161068

In [39]:
grouped.agg(['min', 'max', 'count', 'mean'])

                     data1                               data2            \
                       min       max count      mean       min       max
data1
(-3.505, -1.727] -3.497578 -1.759333    51 -2.108446 -2.076120  2.279837
(-1.727, 0.0433] -1.707023  0.042198   489 -0.661829 -3.352173  2.772332
(0.0433, 1.814]   0.043391  1.803590   422  0.671467 -3.409401  3.055541
(1.814, 3.584]    1.817167  3.584268    38  2.218650 -1.572989  1.440923


                 count      mean
data1
(-3.505, -1.727]    51 -0.006572
(-1.727, 0.0433]   489 -0.051506
(0.0433, 1.814]    422 -0.047973
(1.814, 3.584]      38  0.161068

In [ ]:
s = pd.Series(np.random.standard_normal(6))

In [41]:
states = ["Ohio", "New York", "Vermont", "Florida",
            "Oregon", "Nevada", "California", "Idaho"]

group_key = ["East", "East", "East", "East",
            "West", "West", "West", "West"]

data = pd.Series(np.random.standard_normal(8), index=states)
data

Ohio         -1.527235
New York     -1.615448
Vermont      -2.453809
Florida       1.092299
Oregon        1.222121
Nevada        0.408998
California    1.549884
Idaho        -0.019210
dtype: float64

In [45]:
data[['Vermont', 'Nevada', 'Idaho']] = np.nan
data

Ohio         -1.527235
New York     -1.615448
Vermont            NaN
Florida       1.092299
Oregon        1.222121
Nevada             NaN
California    1.549884
Idaho              NaN
dtype: float64

In [47]:
data.groupby(group_key).size()

East    4
West    4
dtype: int64

In [49]:
data.groupby(group_key).count()

East    3
West    2
dtype: int64

In [50]:
data.groupby(group_key).mean()

East   -0.683461
West    1.386003
dtype: float64

In [53]:
def fill_mean(group):
    return group.fillna(group.mean())

data.groupby(group_key).apply(fill_mean)

East  Ohio         -1.527235
      New York     -1.615448
      Vermont      -0.683461
      Florida       1.092299
West  Oregon        1.222121
      Nevada        1.386003
      California    1.549884
      Idaho         1.386003
dtype: float64

In [54]:
fill_values = {'East': 0.5, 'West': -1}

def fill_func(group):
    return group.fillna(fill_values[group.name])

data.groupby(group_key).apply(fill_func)

East  Ohio         -1.527235
      New York     -1.615448
      Vermont       0.500000
      Florida       1.092299
West  Oregon        1.222121
      Nevada       -1.000000
      California    1.549884
      Idaho        -1.000000
dtype: float64

In [55]:
df = pd.DataFrame({'key': ['a', 'b', 'c'] * 4,
                    'value': np.arange(12.)})

df

   key  value
0    a    0.0
1    b    1.0
2    c    2.0
3    a    3.0
4    b    4.0
5    c    5.0
6    a    6.0
7    b    7.0
8    c    8.0
9    a    9.0
10   b   10.0
11   c   11.0

In [56]:
g = df.groupby('key')['value']
g.mean()

key
a    4.5
b    5.5
c    6.5
Name: value, dtype: float64

In [59]:
def get_mean(group):
    return group.mean()

g.transform(get_mean)

0     4.5
1     5.5
2     6.5
3     4.5
4     5.5
5     6.5
6     4.5
7     5.5
8     6.5
9     4.5
10    5.5
11    6.5
Name: value, dtype: float64

In [61]:
g.transform('mean')

0     4.5
1     5.5
2     6.5
3     4.5
4     5.5
5     6.5
6     4.5
7     5.5
8     6.5
9     4.5
10    5.5
11    6.5
Name: value, dtype: float64

In [62]:
def times_two(group):
    return group * 2

g.transform(times_two)

0      0.0
1      2.0
2      4.0
3      6.0
4      8.0
5     10.0
6     12.0
7     14.0
8     16.0
9     18.0
10    20.0
11    22.0
Name: value, dtype: float64

In [63]:
def get_ranks(group):
    return group.rank(ascending=False)

g.transform(get_ranks)

0     4.0
1     4.0
2     4.0
3     3.0
4     3.0
5     3.0
6     2.0
7     2.0
8     2.0
9     1.0
10    1.0
11    1.0
Name: value, dtype: float64

In [77]:
from io import StringIO

data = """Sample Nationality
1 USA Right-handed
2 Japan Left-handed
3 USA Right-handed
4 Japan Right-handed
5 Japan Left-handed
6 Japan Right-handed
7 USA Right-handed
8 USA Left-handed
9 Japan Right-handed
10 USA Right-handed"""

data = pd.read_table(StringIO(data), sep="\s+")
data = data.reset_index()
data = data.rename(columns={'Nationality': 'Handedness',
                            'Sample': 'Nationality',
                            'index': 'Sample'})
data

<>:15: SyntaxWarning: invalid escape sequence '\s'
<>:15: SyntaxWarning: invalid escape sequence '\s'
/tmp/ipykernel_5233/1657588936.py:15: SyntaxWarning: invalid escape sequence '\s'
  data = pd.read_table(StringIO(data), sep="\s+")

   Sample Nationality    Handedness
0       1         USA  Right-handed
1       2       Japan   Left-handed
2       3         USA  Right-handed
3       4       Japan  Right-handed
4       5       Japan   Left-handed
5       6       Japan  Right-handed
6       7         USA  Right-handed
7       8         USA   Left-handed
8       9       Japan  Right-handed
9      10         USA  Right-handed

In [78]:
pd.crosstab(data['Nationality'], data['Handedness'], margins=True)

Handedness   Left-handed  Right-handed  All
Nationality
Japan                  2             3    5
USA                    1             4    5
All                    3             7   10